Tekla Open API Reference for Tekla Structures 2025
AnalysisBar Methods
The AnalysisBar type exposes the following members.
Methods
Name | Description
Add(AnalysisPosition)
 Adds a position to the analysis bar.
Add(AnalysisPosition, AnalysisMember)
 Adds a position and member to the analysis bar.
Delete
 Deletes an analysis bar. The method is not implemented.
GetMembers
 Gets the members of the analysis bar.
GetPositions
 Gets the positions of the analysis bar.
Modify
 Modifies an analysis bar. The method is not implemented.
Select
 Selects an analysis bar. The AnalysisModelName and ID have to be set.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
AnalysisBar Class
Tekla.Structures.Analysis Namespace